// Імпортуємо бібліотеку dotenv для роботи зі змінними середовища
import dotenv from 'dotenv';

// конфігурація .env-файлу
dotenv.config();

// Функція для отримання значення змінної середовища
// приймає два аргументи:
// 1. name - назва змінної середовища
// 2. defaultValue - значення за замовчуванням
// Якщо змінна середовища не вказана, то повертається значення за замовчуванням
export function getEnvVar(name, defaultValue) {
  // Отримання значення змінної середовища
  const value = process.env[name];
  // Якщо значення змінної середовища вказане, то повертаємо його
  if (value) {
    return value;
  }
  // Якщо значення змінної середовища не вказане, то повертаємо значення за замовчуванням
  if (defaultValue) {
    return defaultValue;
  }
  // Якщо значення змінної середовища не вказане та значення за замовчуванням не вказане,
  // то викидаємо помилку
  throw new Error(`Missing: process.env['${name}']`);
}
